{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "cb48fe3d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import pandas as pd\n",
    "from typing import List, Dict\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a17addd3-5f5e-4917-8f0a-86773f6e4725",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>id</th>\n",
       "      <th>title</th>\n",
       "      <th>language</th>\n",
       "      <th>downloads</th>\n",
       "      <th>book_QN</th>\n",
       "      <th>author_QN</th>\n",
       "      <th>authorLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>PG10002</td>\n",
       "      <td>The House on the Borderland</td>\n",
       "      <td>['en']</td>\n",
       "      <td>824</td>\n",
       "      <td>Q740473</td>\n",
       "      <td>Q919277</td>\n",
       "      <td>William Hope Hodgson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>PG10005</td>\n",
       "      <td>A Voyage to the Moon: With Some Account of the...</td>\n",
       "      <td>['en']</td>\n",
       "      <td>42</td>\n",
       "      <td>Q20543676</td>\n",
       "      <td>Q1508382</td>\n",
       "      <td>George Tucker</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>PG10008</td>\n",
       "      <td>The Mystery</td>\n",
       "      <td>['en']</td>\n",
       "      <td>27</td>\n",
       "      <td>Q95981569</td>\n",
       "      <td>Q185406</td>\n",
       "      <td>Samuel Hopkins Adams</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>PG10046</td>\n",
       "      <td>Salute to Adventurers</td>\n",
       "      <td>['en']</td>\n",
       "      <td>24</td>\n",
       "      <td>Q7406333</td>\n",
       "      <td>Q333004</td>\n",
       "      <td>John Buchan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>PG10055</td>\n",
       "      <td>Hamburgische Dramaturgie</td>\n",
       "      <td>['de']</td>\n",
       "      <td>57</td>\n",
       "      <td>Q53585</td>\n",
       "      <td>Q34628</td>\n",
       "      <td>Gotthold Ephraim Lessing</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4550</th>\n",
       "      <td>866</td>\n",
       "      <td>PG9070</td>\n",
       "      <td>The Imaginary Invalid</td>\n",
       "      <td>['en']</td>\n",
       "      <td>1057</td>\n",
       "      <td>Q588161</td>\n",
       "      <td>Q687</td>\n",
       "      <td>Molière</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4551</th>\n",
       "      <td>872</td>\n",
       "      <td>PG944</td>\n",
       "      <td>The Voyage of the Beagle</td>\n",
       "      <td>['en']</td>\n",
       "      <td>874</td>\n",
       "      <td>Q1768515</td>\n",
       "      <td>Q1035</td>\n",
       "      <td>Charles Darwin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4552</th>\n",
       "      <td>884</td>\n",
       "      <td>PG9749</td>\n",
       "      <td>The Highwayman</td>\n",
       "      <td>['en']</td>\n",
       "      <td>29</td>\n",
       "      <td>Q11153710</td>\n",
       "      <td>Q1390604</td>\n",
       "      <td>H. C.Bailey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4553</th>\n",
       "      <td>885</td>\n",
       "      <td>PG9828</td>\n",
       "      <td>Barnen ifrån Frostmofjället</td>\n",
       "      <td>['sv']</td>\n",
       "      <td>36</td>\n",
       "      <td>Q10426505</td>\n",
       "      <td>Q4948162</td>\n",
       "      <td>Laura Fitinghoff</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4554</th>\n",
       "      <td>886</td>\n",
       "      <td>PG982</td>\n",
       "      <td>The Book of Nonsense</td>\n",
       "      <td>['en']</td>\n",
       "      <td>496</td>\n",
       "      <td>Q19020134</td>\n",
       "      <td>Q309759</td>\n",
       "      <td>Edward Lear</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4555 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      Unnamed: 0       id                                              title  \\\n",
       "0              0  PG10002                        The House on the Borderland   \n",
       "1              1  PG10005  A Voyage to the Moon: With Some Account of the...   \n",
       "2              2  PG10008                                        The Mystery   \n",
       "3              3  PG10046                              Salute to Adventurers   \n",
       "4              4  PG10055                           Hamburgische Dramaturgie   \n",
       "...          ...      ...                                                ...   \n",
       "4550         866   PG9070                              The Imaginary Invalid   \n",
       "4551         872    PG944                           The Voyage of the Beagle   \n",
       "4552         884   PG9749                                     The Highwayman   \n",
       "4553         885   PG9828                        Barnen ifrån Frostmofjället   \n",
       "4554         886    PG982                               The Book of Nonsense   \n",
       "\n",
       "     language  downloads    book_QN author_QN               authorLabel  \n",
       "0      ['en']        824    Q740473   Q919277      William Hope Hodgson  \n",
       "1      ['en']         42  Q20543676  Q1508382             George Tucker  \n",
       "2      ['en']         27  Q95981569   Q185406      Samuel Hopkins Adams  \n",
       "3      ['en']         24   Q7406333   Q333004               John Buchan  \n",
       "4      ['de']         57     Q53585    Q34628  Gotthold Ephraim Lessing  \n",
       "...       ...        ...        ...       ...                       ...  \n",
       "4550   ['en']       1057    Q588161      Q687                   Molière  \n",
       "4551   ['en']        874   Q1768515     Q1035            Charles Darwin  \n",
       "4552   ['en']         29  Q11153710  Q1390604               H. C.Bailey  \n",
       "4553   ['sv']         36  Q10426505  Q4948162          Laura Fitinghoff  \n",
       "4554   ['en']        496  Q19020134   Q309759               Edward Lear  \n",
       "\n",
       "[4555 rows x 8 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "fm = pd.read_csv('newest_fm.csv')\n",
    "fm_clean = fm.drop_duplicates(subset=['book_QN'])\n",
    "display(fm)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c52f820e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def getresult(query):\n",
    "    sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\", agent=\"Mozilla/5.0\")\n",
    "#     print(\"connected\")\n",
    "    sparql.addExtraURITag(\"timeout\",\"10000\")\n",
    "    sparql.setQuery(query)\n",
    "#     print(\"A\")\n",
    "    sparql.setReturnFormat(JSON)\n",
    "#     print(\"B\")\n",
    "#     try:\n",
    "    results = sparql.queryAndConvert()\n",
    "#     print(\"C\")\n",
    "#     except Exception as e:\n",
    "#         print(e)\n",
    "    results = results['results']['bindings']\n",
    "    if results:\n",
    "        new_results = []\n",
    "        for result in results:\n",
    "            new_result = {}\n",
    "            for key in result:\n",
    "                new_result[key] = result[key]['value']\n",
    "            new_results.append(new_result)\n",
    "        return new_results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6386503b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = \"\"\"\n",
    "# SELECT ?work ?author ?workLabel (Year(?publicationDate) AS ?PublicationYear) ?authorLabel ?genderLabel ?citizenshipLabel ?birthYear ?deathYear ?religionLabel ?nativeLanguageLabel\n",
    "# WHERE {\n",
    "#   VALUES ?work {wd:Q43361}\n",
    "#   ?work wdt:P577 ?publicationDate.\n",
    "#   VALUES ?author {wd:Q34660}\n",
    "#   ?author   wdt:P21 ?gender;          \n",
    "#             wdt:P27 ?citizenship;      \n",
    "#             wdt:P569 ?birthDate;\n",
    "#   OPTIONAL { ?author wdt:P570 ?deathDate.}\n",
    "#   OPTIONAL { ?author wdt:P140 ?religion. }\n",
    "#   OPTIONAL { ?author wdt:P103 ?nativeLanguage. }\n",
    "#   BIND(YEAR(?birthDate) AS ?birthYear)\n",
    "#   BIND(YEAR(?deathDate) AS ?deathYear)\n",
    "#   SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "# }\n",
    "# \"\"\"\n",
    "# p = getresult(query)\n",
    "# result_df = pd.DataFrame.from_dict(p)\n",
    "# display(result_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "903bfea7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# base_query = \"\"\"\n",
    "# SELECT ?work ?author ?workLabel (Year(?publicationDate) AS ?PublicationYear) ?authorLabel ?genderLabel ?citizenshipLabel ?birthYear ?deathYear ?religionLabel ?nativeLanguageLabel\n",
    "# WHERE {\n",
    "#   VALUES ?work {wd:%s}\n",
    "#   ?work wdt:P577 ?publicationDate.\n",
    "#   VALUES ?author {wd:%s}\n",
    "#   ?author   wdt:P21 ?gender;          \n",
    "#             wdt:P27 ?citizenship;      \n",
    "#             wdt:P569 ?birthDate;\n",
    "#   OPTIONAL { ?author wdt:P570 ?deathDate.}\n",
    "#   OPTIONAL { ?author wdt:P140 ?religion. }\n",
    "#   OPTIONAL { ?author wdt:P103 ?nativeLanguage. }\n",
    "#   BIND(YEAR(?birthDate) AS ?birthYear)\n",
    "#   BIND(YEAR(?deathDate) AS ?deathYear)\n",
    "#   SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "# }\n",
    "# \"\"\"\n",
    "# for index, row in fm.iterrows():\n",
    "#     book = row['book_QN']\n",
    "#     author = row['author_QN']\n",
    "#     formatted_query = base_query % (book, author)\n",
    "#     df_1 = getresult(formatted_query)\n",
    "#     if df_1 is not None:\n",
    "#         rdf = pd.DataFrame.from_dict(df_1)\n",
    "#         result_df = pd.concat([result_df,rdf])\n",
    "# display(result_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "9bb6073b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>work</th>\n",
       "      <th>genre</th>\n",
       "      <th>workLabel</th>\n",
       "      <th>genreLabel</th>\n",
       "      <th>PublicationYear</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q43361</td>\n",
       "      <td>http://www.wikidata.org/entity/Q132311</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>fantasy</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q43361</td>\n",
       "      <td>http://www.wikidata.org/entity/Q21802675</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>adventure fiction</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q43361</td>\n",
       "      <td>http://www.wikidata.org/entity/Q111984153</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>young adult fiction</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    work  \\\n",
       "0  http://www.wikidata.org/entity/Q43361   \n",
       "1  http://www.wikidata.org/entity/Q43361   \n",
       "2  http://www.wikidata.org/entity/Q43361   \n",
       "\n",
       "                                       genre  \\\n",
       "0     http://www.wikidata.org/entity/Q132311   \n",
       "1   http://www.wikidata.org/entity/Q21802675   \n",
       "2  http://www.wikidata.org/entity/Q111984153   \n",
       "\n",
       "                                  workLabel           genreLabel  \\\n",
       "0  Harry Potter and the Philosopher's Stone              fantasy   \n",
       "1  Harry Potter and the Philosopher's Stone    adventure fiction   \n",
       "2  Harry Potter and the Philosopher's Stone  young adult fiction   \n",
       "\n",
       "  PublicationYear  \n",
       "0            1997  \n",
       "1            1997  \n",
       "2            1997  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT ?work ?workLabel (Year(?publicationDate) AS ?PublicationYear) ?genre ?genreLabel\n",
    "WHERE {\n",
    "  VALUES ?work {wd:Q43361}\n",
    "  ?work wdt:P577 ?publicationDate;\n",
    "  OPTIONAL { ?work wdt:P136 ?genre. }\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\"\n",
    "p = getresult(query)\n",
    "result_book = pd.DataFrame.from_dict(p)\n",
    "display(result_book)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "93c5ff85",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>work</th>\n",
       "      <th>genre</th>\n",
       "      <th>workLabel</th>\n",
       "      <th>genreLabel</th>\n",
       "      <th>PublicationYear</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q43361</td>\n",
       "      <td>http://www.wikidata.org/entity/Q132311</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>fantasy</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q43361</td>\n",
       "      <td>http://www.wikidata.org/entity/Q21802675</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>adventure fiction</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.wikidata.org/entity/Q43361</td>\n",
       "      <td>http://www.wikidata.org/entity/Q111984153</td>\n",
       "      <td>Harry Potter and the Philosopher's Stone</td>\n",
       "      <td>young adult fiction</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q740473</td>\n",
       "      <td>http://www.wikidata.org/entity/Q132311</td>\n",
       "      <td>The House on the Borderland</td>\n",
       "      <td>fantasy</td>\n",
       "      <td>1908</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q740473</td>\n",
       "      <td>http://www.wikidata.org/entity/Q16575965</td>\n",
       "      <td>The House on the Borderland</td>\n",
       "      <td>horror fiction</td>\n",
       "      <td>1908</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1768515</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1164267</td>\n",
       "      <td>The Voyage of the Beagle</td>\n",
       "      <td>travel book</td>\n",
       "      <td>1839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1768515</td>\n",
       "      <td>http://www.wikidata.org/entity/Q3337126</td>\n",
       "      <td>The Voyage of the Beagle</td>\n",
       "      <td>nature writing</td>\n",
       "      <td>1839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q11153710</td>\n",
       "      <td>http://www.wikidata.org/entity/Q474090</td>\n",
       "      <td>The Highwayman</td>\n",
       "      <td>narrative poetry</td>\n",
       "      <td>1906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q10426505</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Barnen ifrån Frostmofjället</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1907</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q19020134</td>\n",
       "      <td>NaN</td>\n",
       "      <td>The Book of Nonsense</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1887</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4785 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        work  \\\n",
       "0      http://www.wikidata.org/entity/Q43361   \n",
       "1      http://www.wikidata.org/entity/Q43361   \n",
       "2      http://www.wikidata.org/entity/Q43361   \n",
       "0     http://www.wikidata.org/entity/Q740473   \n",
       "1     http://www.wikidata.org/entity/Q740473   \n",
       "..                                       ...   \n",
       "0    http://www.wikidata.org/entity/Q1768515   \n",
       "1    http://www.wikidata.org/entity/Q1768515   \n",
       "0   http://www.wikidata.org/entity/Q11153710   \n",
       "0   http://www.wikidata.org/entity/Q10426505   \n",
       "0   http://www.wikidata.org/entity/Q19020134   \n",
       "\n",
       "                                        genre  \\\n",
       "0      http://www.wikidata.org/entity/Q132311   \n",
       "1    http://www.wikidata.org/entity/Q21802675   \n",
       "2   http://www.wikidata.org/entity/Q111984153   \n",
       "0      http://www.wikidata.org/entity/Q132311   \n",
       "1    http://www.wikidata.org/entity/Q16575965   \n",
       "..                                        ...   \n",
       "0     http://www.wikidata.org/entity/Q1164267   \n",
       "1     http://www.wikidata.org/entity/Q3337126   \n",
       "0      http://www.wikidata.org/entity/Q474090   \n",
       "0                                         NaN   \n",
       "0                                         NaN   \n",
       "\n",
       "                                   workLabel           genreLabel  \\\n",
       "0   Harry Potter and the Philosopher's Stone              fantasy   \n",
       "1   Harry Potter and the Philosopher's Stone    adventure fiction   \n",
       "2   Harry Potter and the Philosopher's Stone  young adult fiction   \n",
       "0                The House on the Borderland              fantasy   \n",
       "1                The House on the Borderland       horror fiction   \n",
       "..                                       ...                  ...   \n",
       "0                   The Voyage of the Beagle          travel book   \n",
       "1                   The Voyage of the Beagle       nature writing   \n",
       "0                             The Highwayman     narrative poetry   \n",
       "0                Barnen ifrån Frostmofjället                  NaN   \n",
       "0                       The Book of Nonsense                  NaN   \n",
       "\n",
       "   PublicationYear  \n",
       "0             1997  \n",
       "1             1997  \n",
       "2             1997  \n",
       "0             1908  \n",
       "1             1908  \n",
       "..             ...  \n",
       "0             1839  \n",
       "1             1839  \n",
       "0             1906  \n",
       "0             1907  \n",
       "0             1887  \n",
       "\n",
       "[4785 rows x 5 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "book_query = \"\"\"\n",
    "SELECT ?work ?workLabel (Year(?publicationDate) AS ?PublicationYear) ?genre ?genreLabel\n",
    "WHERE {\n",
    "  VALUES ?work {wd:%s}\n",
    "  ?work wdt:P577 ?publicationDate;\n",
    "  OPTIONAL { ?work wdt:P136 ?genre. }\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\"\n",
    "for index, row in fm.iterrows():\n",
    "    book = row['book_QN']\n",
    "    formatted_query = book_query % (book)\n",
    "    book_df_1 = getresult(formatted_query)\n",
    "    if book_df_1 is not None:\n",
    "        book_df = pd.DataFrame.from_dict(book_df_1)\n",
    "        result_book = pd.concat([result_book,book_df])\n",
    "display(result_book)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a58eac02",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_book.to_csv('book_info.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "92c26b12",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>birthYear</th>\n",
       "      <th>authorLabel</th>\n",
       "      <th>genderLabel</th>\n",
       "      <th>citizenshipLabel</th>\n",
       "      <th>religionLabel</th>\n",
       "      <th>nativeLanguageLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q34660</td>\n",
       "      <td>1965</td>\n",
       "      <td>J. K. Rowling</td>\n",
       "      <td>female</td>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>Anglicanism</td>\n",
       "      <td>British English</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  author birthYear    authorLabel genderLabel  \\\n",
       "0  http://www.wikidata.org/entity/Q34660      1965  J. K. Rowling      female   \n",
       "\n",
       "  citizenshipLabel religionLabel nativeLanguageLabel  \n",
       "0   United Kingdom   Anglicanism     British English  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT ?author ?authorLabel ?genderLabel ?citizenshipLabel ?birthYear ?deathYear ?religionLabel ?nativeLanguageLabel\n",
    "WHERE {\n",
    "  VALUES ?author {wd:Q34660}\n",
    "  ?author   wdt:P21 ?gender;              \n",
    "            wdt:P569 ?birthDate;\n",
    "  OPTIONAL { ?author wdt:P570 ?deathDate.}\n",
    "  OPTIONAL { ?author wdt:P27 ?citizenship.}\n",
    "  OPTIONAL { ?author wdt:P140 ?religion. }\n",
    "  OPTIONAL { ?author wdt:P103 ?nativeLanguage. }\n",
    "  BIND(YEAR(?birthDate) AS ?birthYear)\n",
    "  BIND(YEAR(?deathDate) AS ?deathYear)\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\"\n",
    "p = getresult(query)\n",
    "result_author = pd.DataFrame.from_dict(p)\n",
    "display(result_author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c6408d76",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q919277\n",
      "Q1508382\n",
      "Q185406\n",
      "Q333004\n",
      "Q34628\n",
      "Q207544\n",
      "Q468156\n",
      "Q42511\n",
      "Q525713\n",
      "Q167856\n",
      "Q36184\n",
      "Q7167372\n",
      "Q30875\n",
      "Q477999\n",
      "Q6759691\n",
      "Q5686\n",
      "Q1387643\n",
      "Q1564825\n",
      "Q146763\n",
      "Q127332\n",
      "Q20733\n",
      "Q45765\n",
      "Q170509\n",
      "Q704860\n",
      "Q33977\n",
      "Q271961\n",
      "Q212719\n",
      "Q5879\n",
      "Q1294394\n",
      "Q353238\n",
      "Q1444002\n",
      "Q453577\n",
      "Q548040\n",
      "Q2668090\n",
      "Q50020\n",
      "Q535\n",
      "Q219829\n",
      "Q7245\n",
      "Q692\n",
      "Q348623\n",
      "Q151403\n",
      "Q438241\n",
      "Q234530\n",
      "Q35610\n",
      "Q82925\n",
      "Q36322\n",
      "Q16867\n",
      "Q314158\n",
      "Q502912\n",
      "Q148234\n",
      "Q25351\n",
      "Q504\n",
      "Q1371577\n",
      "Q1676368\n",
      "Q9327\n",
      "Q202749\n",
      "Q131333\n",
      "Q16063166\n",
      "Q132805\n",
      "Q259132\n",
      "Q458658\n",
      "Q41166\n",
      "Q43718\n",
      "Q313932\n",
      "Q771698\n",
      "Q237196\n",
      "Q507991\n",
      "Q462363\n",
      "Q44519\n",
      "Q763341\n",
      "Q447240\n",
      "Q40826\n",
      "Q893138\n",
      "Q478450\n",
      "Q154211\n",
      "Q944063\n",
      "Q311854\n",
      "Q47484\n",
      "Q9711\n",
      "Q276032\n",
      "Q42443\n",
      "Q126596\n",
      "Q460366\n",
      "Q2065950\n",
      "Q5337523\n",
      "Q5075251\n",
      "Q102513\n",
      "Q1699846\n",
      "Q18911708\n",
      "Q5531480\n",
      "Q506757\n",
      "Q2517956\n",
      "Q965927\n",
      "Q1382113\n",
      "Q713284\n",
      "Q276028\n",
      "Q4798900\n",
      "Q457287\n",
      "Q34190\n",
      "Q183167\n",
      "Q3297881\n",
      "Q560015\n",
      "Q35064\n",
      "Q191026\n",
      "Q123469\n",
      "Q5536746\n",
      "Q6221558\n",
      "Q369790\n",
      "Q984\n",
      "Q246953\n",
      "Q723374\n",
      "Q318399\n",
      "Q37693\n",
      "Q442130\n",
      "Q41502\n",
      "Q115822\n",
      "Q33866\n",
      "Q326138\n",
      "Q216904\n",
      "Q510258\n",
      "Q38337\n",
      "Q258741\n",
      "Q82006\n",
      "Q3611689\n",
      "Q1131497\n",
      "Q81796\n",
      "Q3889326\n",
      "Q366805\n",
      "Q2603993\n",
      "Q38082\n",
      "Q294181\n",
      "Q37030\n",
      "Q433098\n",
      "Q1512\n",
      "Q214565\n",
      "Q1700884\n",
      "Q215724\n",
      "Q1385758\n",
      "Q315003\n",
      "Q952452\n",
      "Q1246814\n",
      "Q1507549\n",
      "Q1035\n",
      "Q1399\n",
      "Q670179\n",
      "Q5362696\n",
      "Q5478699\n",
      "Q183713\n",
      "Q4944529\n",
      "Q37103\n",
      "Q40909\n",
      "Q540427\n",
      "Q132524\n",
      "Q3816\n",
      "Q7647785\n",
      "Q536012\n",
      "Q283496\n",
      "Q5673\n",
      "Q439204\n",
      "Q6701\n",
      "Q79025\n",
      "Q191050\n",
      "Q6261044\n",
      "Q561408\n",
      "Q468247\n",
      "Q351705\n",
      "Q192927\n",
      "Q334839\n",
      "Q382786\n",
      "Q43444\n",
      "Q322871\n",
      "Q1092762\n",
      "Q1293795\n",
      "Q467770\n",
      "Q1281119\n",
      "Q8005600\n",
      "Q314993\n",
      "Q34743\n",
      "Q1402\n",
      "Q274254\n",
      "Q6284021\n",
      "Q298027\n",
      "Q439370\n",
      "Q7243\n",
      "Q37767\n",
      "Q81438\n",
      "Q6264132\n",
      "Q137679\n",
      "Q228546\n",
      "Q180989\n",
      "Q8009658\n",
      "Q1175275\n",
      "Q3275944\n",
      "Q562719\n",
      "Q218698\n",
      "Q1585832\n",
      "Q5416320\n",
      "Q5685\n",
      "Q312444\n",
      "Q4661753\n",
      "Q258001\n",
      "Q2331155\n",
      "Q9061\n",
      "Q505017\n",
      "Q181667\n",
      "Q561378\n",
      "Q273034\n",
      "Q229480\n",
      "Q173869\n",
      "Q309759\n",
      "Q247473\n",
      "Q717186\n",
      "Q4985\n",
      "Q859\n",
      "Q298827\n",
      "Q123089\n",
      "Q434687\n",
      "Q540166\n",
      "Q505715\n",
      "Q5370892\n",
      "Q4892977\n",
      "Q4725909\n",
      "Q216134\n",
      "Q268305\n",
      "Q4895515\n",
      "Q210740\n",
      "Q134942\n",
      "Q6774396\n",
      "Q270632\n",
      "Q551767\n",
      "Q231708\n",
      "Q151180\n",
      "Q102851\n",
      "Q498976\n",
      "Q782813\n",
      "Q458390\n",
      "Q433767\n",
      "Q8016\n",
      "Q123053\n",
      "Q235368\n",
      "Q1340161\n",
      "Q311526\n",
      "Q6694\n",
      "Q15442136\n",
      "Q2331144\n",
      "Q7344917\n",
      "Q472071\n",
      "Q12706\n",
      "Q5080612\n",
      "Q1699168\n",
      "Q712746\n",
      "Q1500\n",
      "Q126462\n",
      "Q332580\n",
      "Q3300924\n",
      "Q19185\n",
      "Q4942781\n",
      "Q34969\n",
      "Q2342103\n",
      "Q5298346\n",
      "Q1541\n",
      "Q237833\n",
      "Q5393723\n",
      "Q210798\n",
      "Q311548\n",
      "Q82409\n",
      "Q47152\n",
      "Q3568976\n",
      "Q712073\n",
      "Q188385\n",
      "Q2415217\n",
      "Q294147\n",
      "Q4977173\n",
      "Q9215\n",
      "Q46830\n",
      "Q518359\n",
      "Q526709\n",
      "Q728405\n",
      "Q6780145\n",
      "Q469681\n",
      "Q6305859\n",
      "Q2493772\n",
      "Q234050\n",
      "Q3721233\n",
      "Q447019\n",
      "Q9317\n",
      "Q4958416\n",
      "Q2043891\n",
      "Q238140\n",
      "Q110016595\n",
      "Q96007487\n",
      "Q983125\n",
      "Q786616\n",
      "Q172788\n",
      "Q6307756\n",
      "Q464318\n",
      "Q508101\n",
      "Q5077925\n",
      "Q230476\n",
      "Q5664346\n",
      "Q1355998\n",
      "Q160333\n",
      "Q965138\n",
      "Q983348\n",
      "Q6548477\n",
      "Q185696\n",
      "Q368519\n",
      "Q980339\n",
      "Q150445\n",
      "Q433325\n",
      "Q463513\n",
      "Q7167474\n",
      "Q389375\n",
      "Q88458\n",
      "Q15975273\n",
      "Q448376\n",
      "Q357102\n",
      "Q90238\n",
      "Q4443905\n",
      "Q2620572\n",
      "Q235899\n",
      "Q3909034\n",
      "Q515845\n",
      "Q182589\n",
      "Q93841\n",
      "Q110436\n",
      "Q312673\n",
      "Q2402392\n",
      "Q570031\n",
      "Q301983\n",
      "Q611238\n",
      "Q734329\n",
      "Q706891\n",
      "Q463630\n",
      "Q43523\n",
      "Q3218752\n",
      "Q931105\n",
      "Q27981888\n",
      "Q550449\n",
      "Q2060612\n",
      "Q276421\n",
      "Q3316148\n",
      "Q922191\n",
      "Q25973\n",
      "Q437798\n",
      "Q2037944\n",
      "Q675676\n",
      "Q943858\n",
      "Q482162\n",
      "Q518925\n",
      "Q974678\n",
      "Q1364100\n",
      "Q372032\n",
      "Q1357524\n",
      "Q311480\n",
      "Q713705\n",
      "Q3087202\n",
      "Q465681\n",
      "Q44331\n",
      "Q309702\n",
      "Q298152\n",
      "Q486096\n",
      "Q468280\n",
      "Q2030046\n",
      "Q1249210\n",
      "Q207036\n",
      "Q360079\n",
      "Q163069\n",
      "Q1048\n",
      "Q6241173\n",
      "Q49767\n",
      "Q313348\n",
      "Q1347392\n",
      "Q5403184\n",
      "Q2731171\n",
      "Q2655\n",
      "Q312829\n",
      "Q5536171\n",
      "Q953962\n",
      "Q462662\n",
      "Q69339\n",
      "Q570122\n",
      "Q36661\n",
      "Q970981\n",
      "Q216954\n",
      "Q9358\n",
      "Q41513\n",
      "Q5478659\n",
      "Q366639\n",
      "Q76430\n",
      "Q4119359\n",
      "Q345104\n",
      "Q199588\n",
      "Q354828\n",
      "Q204936\n",
      "Q6518053\n",
      "Q5321848\n",
      "Q19187967\n",
      "Q81447\n",
      "Q167768\n",
      "Q465179\n",
      "Q58811\n",
      "Q1364808\n",
      "Q26993\n",
      "Q5365036\n",
      "Q6233717\n",
      "Q162269\n",
      "Q9068\n",
      "Q173481\n",
      "Q152513\n",
      "Q4228309\n",
      "Q5622672\n",
      "Q460861\n",
      "Q963715\n",
      "Q9204\n",
      "Q207515\n",
      "Q113681\n",
      "Q1392055\n",
      "Q5661413\n",
      "Q435056\n",
      "Q2137717\n",
      "Q531606\n",
      "Q5006262\n",
      "Q941794\n",
      "Q218960\n",
      "Q215562\n",
      "Q258669\n",
      "Q8006734\n",
      "Q18216966\n",
      "Q5542993\n",
      "Q527981\n",
      "Q1288644\n",
      "Q1700099\n",
      "Q131149\n",
      "Q6882\n",
      "Q471413\n",
      "Q213355\n",
      "Q183266\n",
      "Q27645\n",
      "Q453251\n",
      "Q15430684\n",
      "Q144090\n",
      "Q446879\n",
      "Q505827\n",
      "Q433755\n",
      "Q3184948\n",
      "Q271824\n",
      "Q333246\n",
      "Q2865103\n",
      "Q1393388\n",
      "Q79759\n",
      "Q544314\n",
      "Q6929948\n",
      "Q122370\n",
      "Q108206\n",
      "Q4937514\n",
      "Q154014\n",
      "Q5660569\n",
      "Q49074\n",
      "Q644784\n",
      "Q42544\n",
      "Q168728\n",
      "Q5679\n",
      "Q32829\n",
      "Q4530036\n",
      "Q7348270\n",
      "Q1349144\n",
      "Q229226\n",
      "Q5486693\n",
      "Q296244\n",
      "Q314897\n",
      "Q356283\n",
      "Q79969\n",
      "Q265792\n",
      "Q252307\n",
      "Q2579425\n",
      "Q454734\n",
      "Q724395\n",
      "Q34970\n",
      "Q3946632\n",
      "Q288210\n",
      "Q6897658\n",
      "Q489193\n",
      "Q154010\n",
      "Q76483\n",
      "Q154782\n",
      "Q991\n",
      "Q469974\n",
      "Q27888932\n",
      "Q12407121\n",
      "Q38221441\n",
      "Q944409\n",
      "Q286722\n",
      "Q63055\n",
      "Q109540\n",
      "Q189119\n",
      "Q443325\n",
      "Q52155909\n",
      "Q2042924\n",
      "Q93157\n",
      "Q455776\n",
      "Q941810\n",
      "Q57946\n",
      "Q77486\n",
      "Q734054\n",
      "Q1195523\n",
      "Q43393\n",
      "Q547414\n",
      "Q2076898\n",
      "Q437184\n",
      "Q1405996\n",
      "Q7827414\n",
      "Q193236\n",
      "Q1891579\n",
      "Q5752\n",
      "Q42529454\n",
      "Q291397\n",
      "Q376398\n",
      "Q5172696\n",
      "Q1270441\n",
      "Q1273998\n",
      "Q5301411\n",
      "Q319871\n",
      "Q18912245\n",
      "Q34787\n",
      "Q4710993\n",
      "Q4115628\n",
      "Q429440\n",
      "Q38203\n",
      "Q5535927\n",
      "Q1193106\n",
      "Q123075\n",
      "Q321660\n",
      "Q947986\n",
      "Q44403\n",
      "Q82083\n",
      "Q2818917\n",
      "Q37388\n",
      "Q5364476\n",
      "Q5077060\n",
      "Q59265161\n",
      "Q370308\n",
      "Q360574\n",
      "Q12571\n",
      "Q44490\n",
      "Q1556094\n",
      "Q42831\n",
      "Q3847508\n",
      "Q7796519\n",
      "Q5363058\n",
      "Q5481115\n",
      "Q7241\n",
      "Q5363377\n",
      "Q4352329\n",
      "Q160627\n",
      "Q1506837\n",
      "Q742371\n",
      "Q705999\n",
      "Q747\n",
      "Q1392250\n",
      "Q82248\n",
      "Q316327\n",
      "Q6698108\n",
      "Q596925\n",
      "Q60369\n",
      "Q727056\n",
      "Q3101534\n",
      "Q4885219\n",
      "Q385138\n",
      "Q18910980\n",
      "Q981949\n",
      "Q42156\n",
      "Q2710684\n",
      "Q5217819\n",
      "Q905\n",
      "Q366296\n",
      "Q55052141\n",
      "Q6065174\n",
      "Q363227\n",
      "Q5171168\n",
      "Q22670\n",
      "Q101638\n",
      "Q274305\n",
      "Q76632\n",
      "Q263270\n",
      "Q179680\n",
      "Q218747\n",
      "Q464409\n",
      "Q123386\n",
      "Q462578\n",
      "Q429858\n",
      "Q5354396\n",
      "Q319829\n",
      "Q19873778\n",
      "Q193608\n",
      "Q333106\n",
      "Q59737\n",
      "Q965117\n",
      "Q6218902\n",
      "Q585351\n",
      "Q314553\n",
      "Q381800\n",
      "Q723598\n",
      "Q5298118\n",
      "Q537112\n",
      "Q971735\n",
      "Q7421805\n",
      "Q589562\n",
      "Q47162\n",
      "Q5344693\n",
      "Q527302\n",
      "Q969183\n",
      "Q329854\n",
      "Q315989\n",
      "Q436664\n",
      "Q562000\n",
      "Q4957212\n",
      "Q243267\n",
      "Q18658486\n",
      "Q79822\n",
      "Q191850\n",
      "Q443132\n",
      "Q16743442\n",
      "Q134461\n",
      "Q2716914\n",
      "Q380719\n",
      "Q714940\n",
      "Q171091\n",
      "Q448\n",
      "Q339842\n",
      "Q733246\n",
      "Q937\n",
      "Q233265\n",
      "Q1285626\n",
      "Q443398\n",
      "Q93354\n",
      "Q51513\n",
      "Q13562962\n",
      "Q316788\n",
      "Q2338545\n",
      "Q2171170\n",
      "Q1680890\n",
      "Q471451\n",
      "Q3336307\n",
      "Q812105\n",
      "Q48226\n",
      "Q295935\n",
      "Q7934\n",
      "Q357839\n",
      "Q609039\n",
      "Q313185\n",
      "Q313553\n",
      "Q159636\n",
      "Q639274\n",
      "Q1648491\n",
      "Q179126\n",
      "Q7724\n",
      "Q8022055\n",
      "Q447268\n",
      "Q722973\n",
      "Q1242472\n",
      "Q182905\n",
      "Q25880\n",
      "Q507699\n",
      "Q332449\n",
      "Q983421\n",
      "Q708581\n",
      "Q725248\n",
      "Q122323\n",
      "Q5006539\n",
      "Q952614\n",
      "Q6261093\n",
      "Q379621\n",
      "Q955217\n",
      "Q34981\n",
      "Q76487\n",
      "Q2329794\n",
      "Q5718303\n",
      "Q5423950\n",
      "Q1960665\n",
      "Q350552\n",
      "Q534599\n",
      "Q538549\n",
      "Q294625\n",
      "Q37621\n",
      "Q80889\n",
      "Q61456\n",
      "Q1849325\n",
      "Q468667\n",
      "Q220883\n",
      "Q40213\n",
      "Q76715\n",
      "Q379580\n",
      "Q29824449\n",
      "Q125249\n",
      "Q5080225\n",
      "Q7114583\n",
      "Q231944\n",
      "Q436581\n",
      "Q207640\n",
      "Q922457\n",
      "Q5052923\n",
      "Q2141938\n",
      "Q4895803\n",
      "Q1283916\n",
      "Q57182\n",
      "Q7357461\n",
      "Q287752\n",
      "Q15999660\n",
      "Q3719069\n",
      "Q5333\n",
      "Q254041\n",
      "Q943991\n",
      "Q706571\n",
      "Q57619\n",
      "Q7287626\n",
      "Q299565\n",
      "Q938005\n",
      "Q201858\n",
      "Q131487\n",
      "Q908589\n",
      "Q4800383\n",
      "Q557512\n",
      "Q2589871\n",
      "Q16487084\n",
      "Q315220\n",
      "Q353746\n",
      "Q5920671\n",
      "Q4726018\n",
      "Q969253\n",
      "Q5354138\n",
      "Q52155452\n",
      "Q4800143\n",
      "Q65448\n",
      "Q4739696\n",
      "Q7509068\n",
      "Q1481362\n",
      "Q16031668\n",
      "Q466068\n",
      "Q195390\n",
      "Q449136\n",
      "Q3561371\n",
      "Q613164\n",
      "Q78846\n",
      "Q1373764\n",
      "Q21084532\n",
      "Q327500\n",
      "Q5670556\n",
      "Q330376\n",
      "Q469996\n",
      "Q761717\n",
      "Q5322031\n",
      "Q1064\n",
      "Q4352362\n",
      "Q77069\n",
      "Q46405\n",
      "Q76480\n",
      "Q77204\n",
      "Q337082\n",
      "Q508029\n",
      "Q1688174\n",
      "Q462666\n",
      "Q6261563\n",
      "Q178106\n",
      "Q94484288\n",
      "Q938841\n",
      "Q315511\n",
      "Q5767691\n",
      "Q346250\n",
      "Q538091\n",
      "Q461310\n",
      "Q58062\n",
      "Q99641139\n",
      "Q151936\n",
      "Q77444\n",
      "Q267481\n",
      "Q2366473\n",
      "Q937439\n",
      "Q436775\n",
      "Q3435536\n",
      "Q74664\n",
      "Q7605796\n",
      "Q6688212\n",
      "Q214947\n",
      "Q444995\n",
      "Q134661\n",
      "Q186748\n",
      "Q4303218\n",
      "Q236669\n",
      "Q8010028\n",
      "Q1871107\n",
      "Q131805\n",
      "Q259530\n",
      "Q982058\n",
      "Q48900\n",
      "Q4309820\n",
      "Q3809662\n",
      "Q4359845\n",
      "Q3142674\n",
      "Q374462\n",
      "Q1076511\n",
      "Q310866\n",
      "Q35802\n",
      "Q76579\n",
      "Q5719103\n",
      "Q23441\n",
      "Q376410\n",
      "Q7788899\n",
      "Q370246\n",
      "Q5052113\n",
      "Q3811584\n",
      "Q77226\n",
      "Q185085\n",
      "Q8013887\n",
      "Q6283945\n",
      "Q30251325\n",
      "Q502\n",
      "Q13515\n",
      "Q3379050\n",
      "Q929695\n",
      "Q33760\n",
      "Q46602\n",
      "Q1348857\n",
      "Q1243973\n",
      "Q49747\n",
      "Q5481321\n",
      "Q4768592\n",
      "Q5082480\n",
      "Q49325\n",
      "Q82049\n",
      "Q4236309\n",
      "Q379211\n",
      "Q4888572\n",
      "Q63408\n",
      "Q16944221\n",
      "Q3489578\n",
      "Q2923472\n",
      "Q723324\n",
      "Q37160\n",
      "Q84714821\n",
      "Q2435319\n",
      "Q321378\n",
      "Q313458\n",
      "Q77318\n",
      "Q2266038\n",
      "Q2266966\n",
      "Q332454\n",
      "Q296809\n",
      "Q3568980\n",
      "Q5362366\n",
      "Q206534\n",
      "Q326459\n",
      "Q5219054\n",
      "Q5496537\n",
      "Q435731\n",
      "Q1598125\n",
      "Q7370119\n",
      "Q433076\n",
      "Q30135078\n",
      "Q314957\n",
      "Q1286297\n",
      "Q76422\n",
      "Q39167718\n",
      "Q60647\n",
      "Q3327092\n",
      "Q160852\n",
      "Q5660079\n",
      "Q3126838\n",
      "Q21546729\n",
      "Q442231\n",
      "Q5322211\n",
      "Q6141084\n",
      "Q356317\n",
      "Q5666786\n",
      "Q2026837\n",
      "Q310800\n",
      "Q1382278\n",
      "Q22109568\n",
      "Q155112\n",
      "Q1235328\n",
      "Q184992\n",
      "Q4970156\n",
      "Q649747\n",
      "Q3525525\n",
      "Q81807\n",
      "Q5890025\n",
      "Q84824\n",
      "Q230299\n",
      "Q315346\n",
      "Q2865905\n",
      "Q287741\n",
      "Q6218678\n",
      "Q271712\n",
      "Q1364647\n",
      "Q272566\n",
      "Q169566\n",
      "Q3048134\n",
      "Q15515663\n",
      "Q296256\n",
      "Q5078843\n",
      "Q6780584\n",
      "Q728558\n",
      "Q452354\n",
      "Q1443787\n",
      "Q545381\n",
      "Q5052655\n",
      "Q1276720\n",
      "Q739385\n",
      "Q7200\n",
      "Q968565\n",
      "Q38193\n",
      "Q73784\n",
      "Q15506292\n",
      "Q1700337\n",
      "Q472270\n",
      "Q15982460\n",
      "Q376859\n",
      "Q7917297\n",
      "Q985138\n",
      "Q171344\n",
      "Q78511\n",
      "Q57940\n",
      "Q662678\n",
      "Q171421\n",
      "Q3431022\n",
      "Q449489\n",
      "Q344080\n",
      "Q957543\n",
      "Q722835\n",
      "Q2550081\n",
      "Q2036789\n",
      "Q6929696\n",
      "Q41584766\n",
      "Q562402\n",
      "Q957519\n",
      "Q6175761\n",
      "Q347356\n",
      "Q5709707\n",
      "Q2519303\n",
      "Q268702\n",
      "Q56650119\n",
      "Q3156744\n",
      "Q4822564\n",
      "Q263254\n",
      "Q57451238\n",
      "Q2712004\n",
      "Q604661\n",
      "Q295386\n",
      "Q2571058\n",
      "Q6317720\n",
      "Q298773\n",
      "Q3345956\n",
      "Q188569\n",
      "Q23715146\n",
      "Q984217\n",
      "Q12718\n",
      "Q715814\n",
      "Q711666\n",
      "Q5487805\n",
      "Q348489\n",
      "Q6376559\n",
      "Q548776\n",
      "Q228494\n",
      "Q189454\n",
      "Q139549\n",
      "Q47737\n",
      "Q459275\n",
      "Q189665\n",
      "Q1825813\n",
      "Q3371696\n",
      "Q1894814\n",
      "Q3193974\n",
      "Q355676\n",
      "Q3746686\n",
      "Q739438\n",
      "Q355245\n",
      "Q866496\n",
      "Q5589250\n",
      "Q47946\n",
      "Q720062\n",
      "Q133855\n",
      "Q270707\n",
      "Q109578839\n",
      "Q1227273\n",
      "Q42596\n",
      "Q3568747\n",
      "Q558410\n",
      "Q3181824\n",
      "Q366325\n",
      "Q3157322\n",
      "Q958310\n",
      "Q5345038\n",
      "Q3090506\n",
      "Q1160957\n",
      "Q112118678\n",
      "Q263067\n",
      "Q1107985\n",
      "Q5362493\n",
      "Q1351464\n",
      "Q5498387\n",
      "Q94689890\n",
      "Q71429\n",
      "Q1650288\n",
      "Q524283\n",
      "Q351410\n",
      "Q379912\n",
      "Q9391\n",
      "Q275367\n",
      "Q177681\n",
      "Q61741322\n",
      "Q8016836\n",
      "Q4493340\n",
      "Q298394\n",
      "Q361026\n",
      "Q78491\n",
      "Q1283557\n",
      "Q1506900\n",
      "Q527156\n",
      "Q5040619\n",
      "Q780102\n",
      "Q3376165\n",
      "Q725445\n",
      "Q34836\n",
      "Q2824774\n",
      "Q313925\n",
      "Q123122615\n",
      "Q7786988\n",
      "Q235505\n",
      "Q5298508\n",
      "Q590532\n",
      "Q464264\n",
      "Q5078914\n",
      "Q744848\n",
      "Q56307883\n",
      "Q19939115\n",
      "Q335064\n",
      "Q2450746\n",
      "Q3394693\n",
      "Q437462\n",
      "Q8004674\n",
      "Q1321778\n",
      "Q1323100\n",
      "Q763507\n",
      "Q117201\n",
      "Q6760032\n",
      "Q645074\n",
      "Q1197667\n",
      "Q1333348\n",
      "Q2739759\n",
      "Q61662\n",
      "Q1277467\n",
      "Q233898\n",
      "Q121060\n",
      "Q188646\n",
      "Q14949059\n",
      "Q18402505\n",
      "Q161841\n",
      "Q161955\n",
      "Q18935980\n",
      "Q2336138\n",
      "Q1064912\n",
      "Q703935\n",
      "Q7368222\n",
      "Q7794762\n",
      "Q7287399\n",
      "Q5577698\n",
      "Q272706\n",
      "Q3161890\n",
      "Q364264\n",
      "Q312242\n",
      "Q3426961\n",
      "Q5512210\n",
      "Q436699\n",
      "Q68208509\n",
      "Q672816\n",
      "Q565684\n",
      "Q1475826\n",
      "Q438924\n",
      "Q5294439\n",
      "Q192069\n",
      "Q8005269\n",
      "Q505923\n",
      "Q33193011\n",
      "Q1899252\n",
      "Q5126571\n",
      "Q150471\n",
      "Q5660172\n",
      "Q2817249\n",
      "Q18243\n",
      "Q464167\n",
      "Q4296277\n",
      "Q207672\n",
      "Q7199\n",
      "Q123261\n",
      "Q40640\n",
      "Q6077927\n",
      "Q203906\n",
      "Q3506829\n",
      "Q316568\n",
      "Q554269\n",
      "Q966324\n",
      "Q218679\n",
      "Q2849427\n",
      "Q36771\n",
      "Q4798061\n",
      "Q466650\n",
      "Q182804\n",
      "Q2382900\n",
      "Q41636203\n",
      "Q643644\n",
      "Q1732676\n",
      "Q2580556\n",
      "Q2831081\n",
      "Q446941\n",
      "Q5119353\n",
      "Q3098292\n",
      "Q5545264\n",
      "Q41532\n",
      "Q6969636\n",
      "Q50305376\n",
      "Q45025\n",
      "Q57966\n",
      "Q28494\n",
      "Q198644\n",
      "Q310309\n",
      "Q16943893\n",
      "Q167821\n",
      "Q18117874\n",
      "Q272537\n",
      "Q460055\n",
      "Q242666\n",
      "Q7925754\n",
      "Q260982\n",
      "Q23434\n",
      "Q227312\n",
      "Q3051213\n",
      "Q9381\n",
      "Q1289140\n",
      "Q2741543\n",
      "Q16210361\n",
      "Q455703\n",
      "Q211133\n",
      "Q107504129\n",
      "Q298388\n",
      "Q311001\n",
      "Q2831281\n",
      "Q7374114\n",
      "Q76417\n",
      "Q562133\n",
      "Q521991\n",
      "Q1615369\n",
      "Q4864587\n",
      "Q235665\n",
      "Q93081\n",
      "Q5338401\n",
      "Q62278\n",
      "Q591270\n",
      "Q2529493\n",
      "Q2840554\n",
      "Q297302\n",
      "Q5536500\n",
      "Q256288\n",
      "Q20734673\n",
      "Q309903\n",
      "Q55068622\n",
      "Q2375353\n",
      "Q6222156\n",
      "Q1287924\n",
      "Q141037\n",
      "Q731510\n",
      "Q18910721\n",
      "Q315509\n",
      "Q25352610\n",
      "Q272\n",
      "Q435725\n",
      "Q444953\n",
      "Q515008\n",
      "Q315072\n",
      "Q1359140\n",
      "Q42516193\n",
      "Q2958729\n",
      "Q6246991\n",
      "Q5802152\n",
      "Q57514\n",
      "Q6834240\n",
      "Q4749132\n",
      "Q312549\n",
      "Q44520\n",
      "Q80137\n",
      "Q6498881\n",
      "Q28975\n",
      "Q123041\n",
      "Q154438\n",
      "Q171976\n",
      "Q4768282\n",
      "Q168542\n",
      "Q6929777\n",
      "Q73646\n",
      "Q455349\n",
      "Q231886\n",
      "Q298703\n",
      "Q470067\n",
      "Q2080961\n",
      "Q257953\n",
      "Q7600027\n",
      "Q183094\n",
      "Q285514\n",
      "Q4156847\n",
      "Q45546\n",
      "Q115371\n",
      "Q363729\n",
      "Q5725557\n",
      "Q46599\n",
      "Q386244\n",
      "Q302880\n",
      "Q164047\n",
      "Q5337310\n",
      "Q465335\n",
      "Q15491484\n",
      "Q3262364\n",
      "Q7347990\n",
      "Q1356259\n",
      "Q43423\n",
      "Q8014765\n",
      "Q129772\n",
      "Q40946\n",
      "Q17534352\n",
      "Q441515\n",
      "Q309907\n",
      "Q225904\n",
      "Q295941\n",
      "Q237575\n",
      "Q66438477\n",
      "Q472232\n",
      "Q961244\n",
      "Q353841\n",
      "Q729541\n",
      "Q336189\n",
      "Q186153\n",
      "Q2736277\n",
      "Q5344654\n",
      "Q981852\n",
      "Q937246\n",
      "Q4762392\n",
      "Q519064\n",
      "Q7382963\n",
      "Q868\n",
      "Q18440246\n",
      "Q6759760\n",
      "Q5343517\n",
      "Q236236\n",
      "Q4767333\n",
      "Q555291\n",
      "Q75196496\n",
      "Q5591308\n",
      "Q17281116\n",
      "Q6456649\n",
      "Q5683\n",
      "Q7150274\n",
      "Q55436248\n",
      "Q41523\n",
      "Q365133\n",
      "Q15814201\n",
      "Q15694112\n",
      "Q94608\n",
      "Q7383228\n",
      "Q16749762\n",
      "Q1339023\n",
      "Q650048\n",
      "Q10308919\n",
      "Q472568\n",
      "Q517634\n",
      "Q11682621\n",
      "Q2031387\n",
      "Q193857\n",
      "Q582694\n",
      "Q28957204\n",
      "Q4722825\n",
      "Q16027929\n",
      "Q957427\n",
      "Q18526800\n",
      "Q86436424\n",
      "Q521589\n",
      "Q5864669\n",
      "Q514305\n",
      "Q6442694\n",
      "Q389233\n",
      "Q1508054\n",
      "Q536979\n",
      "Q441757\n",
      "Q17485888\n",
      "Q561027\n",
      "Q449234\n",
      "Q5740252\n",
      "Q109265455\n",
      "Q30043194\n",
      "Q84761730\n",
      "Q3423476\n",
      "Q2138020\n",
      "Q2546834\n",
      "Q240174\n",
      "Q391591\n",
      "Q22958014\n",
      "Q312551\n",
      "Q201315\n",
      "Q55450104\n",
      "Q1858461\n",
      "Q7198\n",
      "Q78474\n",
      "Q355888\n",
      "Q24766\n",
      "Q183144\n",
      "Q276440\n",
      "Q241299\n",
      "Q48305\n",
      "Q21552417\n",
      "Q131018\n",
      "Q2578528\n",
      "Q372984\n",
      "Q41568\n",
      "Q742\n",
      "Q219646\n",
      "Q435151\n",
      "Q951193\n",
      "Q6755312\n",
      "Q1690875\n",
      "Q18404\n",
      "Q547794\n",
      "Q6003187\n",
      "Q61723\n",
      "Q5362110\n",
      "Q590\n",
      "Q7728\n",
      "Q310341\n",
      "Q8020076\n",
      "Q5297443\n",
      "Q55594379\n",
      "Q891324\n",
      "Q120801947\n",
      "Q370589\n",
      "Q5335062\n",
      "Q215673\n",
      "Q1651497\n",
      "Q535396\n",
      "Q93343\n",
      "Q271032\n",
      "Q170800\n",
      "Q28793867\n",
      "Q963058\n",
      "Q331863\n",
      "Q224029\n",
      "Q687\n",
      "Q7235\n",
      "Q311145\n",
      "Q4907669\n",
      "Q153159\n",
      "Q41309\n",
      "Q1374243\n",
      "Q1285184\n",
      "Q7635294\n",
      "Q50146529\n",
      "Q310791\n",
      "Q88296\n",
      "Q4983493\n",
      "Q81731\n",
      "Q449670\n",
      "Q1680917\n",
      "Q312407\n",
      "Q1151\n",
      "Q3023540\n",
      "Q1390604\n",
      "Q4948162\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>birthYear</th>\n",
       "      <th>authorLabel</th>\n",
       "      <th>genderLabel</th>\n",
       "      <th>citizenshipLabel</th>\n",
       "      <th>religionLabel</th>\n",
       "      <th>nativeLanguageLabel</th>\n",
       "      <th>deathYear</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q34660</td>\n",
       "      <td>1965</td>\n",
       "      <td>J. K. Rowling</td>\n",
       "      <td>female</td>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>Anglicanism</td>\n",
       "      <td>British English</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q919277</td>\n",
       "      <td>1877</td>\n",
       "      <td>William Hope Hodgson</td>\n",
       "      <td>male</td>\n",
       "      <td>United Kingdom of Great Britain and Ireland</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1918</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.wikidata.org/entity/Q919277</td>\n",
       "      <td>1877</td>\n",
       "      <td>William Hope Hodgson</td>\n",
       "      <td>male</td>\n",
       "      <td>United Kingdom of Great Britain and Ireland</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1918</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1508382</td>\n",
       "      <td>1775</td>\n",
       "      <td>George Tucker</td>\n",
       "      <td>male</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1861</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q185406</td>\n",
       "      <td>1871</td>\n",
       "      <td>Samuel Hopkins Adams</td>\n",
       "      <td>male</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1958</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q312407</td>\n",
       "      <td>1896</td>\n",
       "      <td>John Dos Passos</td>\n",
       "      <td>male</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1151</td>\n",
       "      <td>1803</td>\n",
       "      <td>Hector Berlioz</td>\n",
       "      <td>male</td>\n",
       "      <td>France</td>\n",
       "      <td>atheism</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1869</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q3023540</td>\n",
       "      <td>1881</td>\n",
       "      <td>Princess Der Ling</td>\n",
       "      <td>female</td>\n",
       "      <td>Qing Dynasty</td>\n",
       "      <td>Catholic Church</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q1390604</td>\n",
       "      <td>1880</td>\n",
       "      <td>Alfred Noyes</td>\n",
       "      <td>male</td>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>Catholic Church</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1958</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.wikidata.org/entity/Q4948162</td>\n",
       "      <td>1848</td>\n",
       "      <td>Laura Fitinghoff</td>\n",
       "      <td>female</td>\n",
       "      <td>Sweden</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1908</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1871 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     author birthYear           authorLabel  \\\n",
       "0     http://www.wikidata.org/entity/Q34660      1965         J. K. Rowling   \n",
       "0    http://www.wikidata.org/entity/Q919277      1877  William Hope Hodgson   \n",
       "1    http://www.wikidata.org/entity/Q919277      1877  William Hope Hodgson   \n",
       "0   http://www.wikidata.org/entity/Q1508382      1775         George Tucker   \n",
       "0    http://www.wikidata.org/entity/Q185406      1871  Samuel Hopkins Adams   \n",
       "..                                      ...       ...                   ...   \n",
       "0    http://www.wikidata.org/entity/Q312407      1896       John Dos Passos   \n",
       "0      http://www.wikidata.org/entity/Q1151      1803        Hector Berlioz   \n",
       "0   http://www.wikidata.org/entity/Q3023540      1881     Princess Der Ling   \n",
       "0   http://www.wikidata.org/entity/Q1390604      1880          Alfred Noyes   \n",
       "0   http://www.wikidata.org/entity/Q4948162      1848      Laura Fitinghoff   \n",
       "\n",
       "   genderLabel                             citizenshipLabel    religionLabel  \\\n",
       "0       female                               United Kingdom      Anglicanism   \n",
       "0         male  United Kingdom of Great Britain and Ireland              NaN   \n",
       "1         male  United Kingdom of Great Britain and Ireland              NaN   \n",
       "0         male                     United States of America              NaN   \n",
       "0         male                     United States of America              NaN   \n",
       "..         ...                                          ...              ...   \n",
       "0         male                     United States of America              NaN   \n",
       "0         male                                       France          atheism   \n",
       "0       female                                 Qing Dynasty  Catholic Church   \n",
       "0         male                               United Kingdom  Catholic Church   \n",
       "0       female                                       Sweden              NaN   \n",
       "\n",
       "   nativeLanguageLabel deathYear  \n",
       "0      British English       NaN  \n",
       "0                  NaN      1918  \n",
       "1                  NaN      1918  \n",
       "0                  NaN      1861  \n",
       "0                  NaN      1958  \n",
       "..                 ...       ...  \n",
       "0                  NaN      1970  \n",
       "0                  NaN      1869  \n",
       "0                  NaN      1944  \n",
       "0                  NaN      1958  \n",
       "0                  NaN      1908  \n",
       "\n",
       "[1871 rows x 8 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "authors_only = fm.drop_duplicates(subset=['author_QN'])\n",
    "author_query = \"\"\"\n",
    "SELECT ?author ?authorLabel ?genderLabel ?citizenshipLabel ?birthYear ?deathYear ?religionLabel ?nativeLanguageLabel\n",
    "WHERE {\n",
    "  VALUES ?author {wd:%s}\n",
    "  ?author   wdt:P21 ?gender;          \n",
    "            wdt:P27 ?citizenship;      \n",
    "            wdt:P569 ?birthDate;\n",
    "  OPTIONAL { ?author wdt:P570 ?deathDate.}\n",
    "  OPTIONAL { ?author wdt:P140 ?religion. }\n",
    "  OPTIONAL { ?author wdt:P103 ?nativeLanguage. }\n",
    "  BIND(YEAR(?birthDate) AS ?birthYear)\n",
    "  BIND(YEAR(?deathDate) AS ?deathYear)\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\"\n",
    "for index, row in authors_only.iterrows():\n",
    "    author = row['author_QN']\n",
    "    print(author)\n",
    "    formatted_query = author_query % (author)\n",
    "    author_df_1 = getresult(formatted_query)\n",
    "    if author_df_1 is not None:\n",
    "        author_df = pd.DataFrame.from_dict(author_df_1)\n",
    "        result_author = pd.concat([result_author,author_df])\n",
    "display(result_author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "436f46de",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_author.to_csv('author_info.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "53752cad",
   "metadata": {},
   "outputs": [],
   "source": [
    "# result_df = result_df.drop(result_df.index[0], inplace=True)\n",
    "# result_df = result_df.drop_duplicates(subset=['work','author'])\n",
    "copy = result_df.copy()\n",
    "copy = copy.reset_index()\n",
    "display(copy)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3355a958",
   "metadata": {},
   "outputs": [],
   "source": [
    "copy1 = copy[copy['work'] != \"http://www.wikidata.org/entity/Q43361\"]\n",
    "copy1 = copy1.drop_duplicates(subset=['work','author'])\n",
    "copy1 = copy1.rename(columns={'author':\"author_y\",\"work\":\"book\"})\n",
    "exact_match = pd.merge(result, copy1, on = ['book','author_y'])\n",
    "display(exact_match)\n",
    "exact_match.to_csv('exact_match.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7d95bfd4",
   "metadata": {},
   "outputs": [],
   "source": [
    "em = pd.read_csv('exact_match.csv')\n",
    "em = em[em['deathYearMatch'] == 1]\n",
    "em.to_csv(\"EEM.csv\")\n",
    "display(em)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a0d52979",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "SELECT ?personLabel ?work ?workLabel\n",
    "WHERE {\n",
    "  ?person wdt:P800 ?work.\n",
    "  ?work wdt:P31 ?worktype.\n",
    "  FILTER(?worktype = wd:Q7725634 || ?worktype = wd:Q1279564 || ?worktype = wd:Q47461344)\n",
    "  VALUES ?person { wd:Q34660 } # J. K. Rowling's Q number\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\"\n",
    "p = getresult(query)\n",
    "result_author = pd.DataFrame.from_dict(p)\n",
    "display(result_author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "458e037a",
   "metadata": {},
   "outputs": [],
   "source": [
    "author = pd.read_csv('author_info.csv')\n",
    "author['author_QN'] = author['author'].str.split('/').str[-1]\n",
    "display(author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57460822",
   "metadata": {},
   "outputs": [],
   "source": [
    "author_query = \"\"\"\n",
    "SELECT ?person ?personLabel ?work ?workLabel\n",
    "WHERE {\n",
    "  ?person wdt:P800 ?work.\n",
    "  ?work wdt:P31 ?worktype.\n",
    "  FILTER(?worktype = wd:Q7725634 || ?worktype = wd:Q1279564 || ?worktype = wd:Q47461344)\n",
    "  VALUES ?person { wd:%s } # J. K. Rowling's Q number\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\n",
    "\"\"\"\n",
    "for index, row in author.iterrows():\n",
    "    name = row['author_QN']\n",
    "    formatted_query = author_query % (name)\n",
    "    author_df_1 = getresult(formatted_query)\n",
    "    if author_df_1 is not None:\n",
    "        author_df = pd.DataFrame.from_dict(author_df_1)\n",
    "        result_author = pd.concat([result_author,author_df])\n",
    "display(result_author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f2356f9e",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_author.to_csv('author_to_book.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c3221a67",
   "metadata": {},
   "outputs": [],
   "source": [
    "result_author['author'] = result_author['person'].str.split('/').str[-1]\n",
    "result_author['last_name'] = result_author['personLabel'].str.split(' ').str[-1]\n",
    "full = pd.read_csv('metadata.csv')\n",
    "full['last_name'] = full['author'].str.split(',').str[0]\n",
    "matches = pd.merge(full[['title','last_name']],result_author, on = ['last_name'])\n",
    "matches = matches.drop_duplicates(subset=['title','last_name','workLabel'])\n",
    "display(matches)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "43890f83",
   "metadata": {},
   "outputs": [],
   "source": [
    "#display(matches[matches['title'] == matches['workLabel']])\n",
    "display(matches[(matches['author'] == \"Q535\") & (matches['title'] == matches['workLabel'])])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bb764450",
   "metadata": {},
   "outputs": [],
   "source": [
    "from fuzzywuzzy import fuzz\n",
    "match_score = []\n",
    "for index, row in matches.iterrows():\n",
    "    title = row['title']\n",
    "    work = row['workLabel']\n",
    "    score = fuzz.ratio(title, work)\n",
    "    match_score.append(score)\n",
    "matches['match_score'] = match_score\n",
    "display(matches[(matches['match_score'] >= 80) & matches['match_score'] != 100])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "16290f60",
   "metadata": {},
   "outputs": [],
   "source": [
    "display(matches[(matches['match_score'] >= 80) & (matches['match_score'] != 100)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c4827dbb",
   "metadata": {},
   "outputs": [],
   "source": [
    "matches.to_csv(\"match_scores.csv\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
